Archive/Sysbench-0.5/MDEV-13845/RocksDB-Tuning/res12/sysbench.rw.22.32.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Report intermediate results every 2 second(s)
Initializing random number generator from seed (42).


Threads started!

[   2s] threads: 32, tps: 1917.93, reads: 27061.98, writes: 7705.21, response time: 35.86ms (95%), errors: 0.00, reconnects:  0.00
[   4s] threads: 32, tps: 2009.01, reads: 28137.60, writes: 8064.53, response time: 32.83ms (95%), errors: 0.00, reconnects:  0.00
[   6s] threads: 32, tps: 2032.50, reads: 28453.51, writes: 8128.00, response time: 33.53ms (95%), errors: 0.00, reconnects:  0.00
[   8s] threads: 32, tps: 1946.50, reads: 27245.49, writes: 7786.00, response time: 36.91ms (95%), errors: 0.00, reconnects:  0.00
[  10s] threads: 32, tps: 1926.50, reads: 26974.00, writes: 7706.50, response time: 36.61ms (95%), errors: 0.00, reconnects:  0.00
[  12s] threads: 32, tps: 2050.50, reads: 28703.96, writes: 8201.49, response time: 32.98ms (95%), errors: 0.00, reconnects:  0.00
[  14s] threads: 32, tps: 2007.00, reads: 28099.00, writes: 8022.00, response time: 34.48ms (95%), errors: 0.00, reconnects:  0.00
[  16s] threads: 32, tps: 2068.50, reads: 28957.01, writes: 8268.00, response time: 33.87ms (95%), errors: 0.00, reconnects:  0.00
[  18s] threads: 32, tps: 1977.50, reads: 27645.00, writes: 7907.50, response time: 35.24ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 32, tps: 2007.50, reads: 28127.02, writes: 8013.51, response time: 33.85ms (95%), errors: 0.00, reconnects:  0.00
[  22s] threads: 32, tps: 2098.00, reads: 29394.47, writes: 8421.99, response time: 32.70ms (95%), errors: 0.00, reconnects:  0.00
[  24s] threads: 32, tps: 1889.00, reads: 26442.99, writes: 7551.00, response time: 35.18ms (95%), errors: 0.00, reconnects:  0.00
[  26s] threads: 32, tps: 1994.50, reads: 27927.07, writes: 7982.52, response time: 34.40ms (95%), errors: 0.00, reconnects:  0.00
[  28s] threads: 32, tps: 1960.50, reads: 27404.51, writes: 7821.50, response time: 35.04ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 32, tps: 2008.50, reads: 28162.48, writes: 8055.99, response time: 35.58ms (95%), errors: 0.00, reconnects:  0.00
[  32s] threads: 32, tps: 2038.50, reads: 28528.49, writes: 8136.00, response time: 33.15ms (95%), errors: 0.00, reconnects:  0.00
[  34s] threads: 32, tps: 2067.00, reads: 28917.45, writes: 8239.99, response time: 32.97ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 32, tps: 1957.50, reads: 27384.43, writes: 7839.98, response time: 34.74ms (95%), errors: 0.00, reconnects:  0.00
[  38s] threads: 32, tps: 2048.51, reads: 28728.12, writes: 8230.03, response time: 33.05ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 32, tps: 1936.50, reads: 27108.01, writes: 7731.50, response time: 35.36ms (95%), errors: 0.00, reconnects:  0.00
[  42s] threads: 32, tps: 2066.00, reads: 28930.49, writes: 8280.50, response time: 32.95ms (95%), errors: 0.00, reconnects:  0.00
[  44s] threads: 32, tps: 2074.50, reads: 29038.98, writes: 8290.99, response time: 33.21ms (95%), errors: 0.00, reconnects:  0.00
[  46s] threads: 32, tps: 2010.50, reads: 28149.54, writes: 8046.01, response time: 34.14ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 32, tps: 2055.00, reads: 28769.00, writes: 8221.00, response time: 33.48ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 32, tps: 2171.00, reads: 30333.97, writes: 8654.49, response time: 30.73ms (95%), errors: 0.00, reconnects:  0.00
[  52s] threads: 32, tps: 2052.00, reads: 28788.50, writes: 8232.50, response time: 33.63ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 32, tps: 1991.99, reads: 27813.90, writes: 7942.97, response time: 35.14ms (95%), errors: 0.00, reconnects:  0.00
[  56s] threads: 32, tps: 2051.50, reads: 28795.56, writes: 8237.52, response time: 32.57ms (95%), errors: 0.00, reconnects:  0.00
[  58s] threads: 32, tps: 1971.50, reads: 27565.04, writes: 7868.51, response time: 35.72ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 32, tps: 2002.99, reads: 28072.81, writes: 8027.44, response time: 34.09ms (95%), errors: 0.00, reconnects:  0.00
[  62s] threads: 32, tps: 2073.01, reads: 28989.20, writes: 8267.56, response time: 33.53ms (95%), errors: 0.00, reconnects:  0.00
[  64s] threads: 32, tps: 1898.50, reads: 26613.96, writes: 7618.99, response time: 36.87ms (95%), errors: 0.00, reconnects:  0.00
[  66s] threads: 32, tps: 2032.50, reads: 28456.99, writes: 8130.00, response time: 33.37ms (95%), errors: 0.00, reconnects:  0.00
[  68s] threads: 32, tps: 2013.00, reads: 28163.56, writes: 8044.02, response time: 34.62ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 32, tps: 2032.50, reads: 28460.02, writes: 8120.01, response time: 33.03ms (95%), errors: 0.00, reconnects:  0.00
[  72s] threads: 32, tps: 1929.00, reads: 27021.99, writes: 7735.00, response time: 35.32ms (95%), errors: 0.00, reconnects:  0.00
[  74s] threads: 32, tps: 2052.49, reads: 28722.89, writes: 8206.97, response time: 32.98ms (95%), errors: 0.00, reconnects:  0.00
[  76s] threads: 32, tps: 1964.50, reads: 27511.04, writes: 7852.01, response time: 34.07ms (95%), errors: 0.00, reconnects:  0.00
[  78s] threads: 32, tps: 2018.50, reads: 28256.54, writes: 8081.01, response time: 33.24ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 32, tps: 2034.00, reads: 28477.45, writes: 8132.99, response time: 35.00ms (95%), errors: 0.00, reconnects:  0.00
[  82s] threads: 32, tps: 2017.51, reads: 28238.58, writes: 8066.02, response time: 34.18ms (95%), errors: 0.00, reconnects:  0.00
[  84s] threads: 32, tps: 2011.00, reads: 28140.96, writes: 8019.99, response time: 34.05ms (95%), errors: 0.00, reconnects:  0.00
[  86s] threads: 32, tps: 1969.99, reads: 27605.30, writes: 7912.44, response time: 35.38ms (95%), errors: 0.00, reconnects:  0.00
[  88s] threads: 32, tps: 1919.02, reads: 26860.23, writes: 7675.56, response time: 35.15ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 32, tps: 1941.50, reads: 27181.96, writes: 7765.99, response time: 36.20ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            2556764
        write:                           730504
        other:                           365252
        total:                           3652520
    transactions:                        182626 (2006.78 per sec.)
    read/write requests:                 3287268 (36122.07 per sec.)
    other operations:                    365252 (4013.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          91.0044s
    total number of events:              182626
    total time taken by event execution: 2911.7560s
    response time:
         min:                                  2.73ms
         avg:                                 15.94ms
         max:                                148.75ms
         approx.  95 percentile:              34.18ms

Threads fairness:
    events (avg/stddev):           5707.0625/37.06
    execution time (avg/stddev):   90.9924/0.00